In [30]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.5.3'

In [11]:
dados = {'Estado': ['Santa Catarina', 'Rio de Janeiro', 'Tocatins', 'Bahia', 'Minas Gerais'],
        'Ano': [2004, 2005, 2006, 2007,2008],
        'Taxa Desemprego': [1.5, 1.7, 1.6, 2.4, 2.7]}

In [12]:
# Importando a função DataFrame do Pandas
from pandas import DataFrame

In [13]:
# Convertendo o dicionario em DataFrame
df = DataFrame(dados)

In [14]:
# Visualiza as 5 primeiras linhas
df.head()

           Estado   Ano  Taxa Desemprego
0  Santa Catarina  2004              1.5
1  Rio de Janeiro  2005              1.7
2        Tocatins  2006              1.6
3           Bahia  2007              2.4
4    Minas Gerais  2008              2.7

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
# Reorganizando as colunas

DataFrame(dados, columns = ['Estado', 'Taxa Desemprego', 'Ano'])

           Estado  Taxa Desemprego   Ano
0  Santa Catarina              1.5  2004
1  Rio de Janeiro              1.7  2005
2        Tocatins              1.6  2006
3           Bahia              2.4  2007
4    Minas Gerais              2.7  2008

In [19]:
# Adicioanndo colunas 

df2 = DataFrame(dados,
               columns = ['Estado', 'Taxa Desemprego', 'Taxa Crescimento', 'Ano'],
               index = ['estado1', 'estado2', 'estado3', 'estado4', 'estado5'])

In [20]:
df2

                 Estado  Taxa Desemprego Taxa Crescimento   Ano
estado1  Santa Catarina              1.5              NaN  2004
estado2  Rio de Janeiro              1.7              NaN  2005
estado3        Tocatins              1.6              NaN  2006
estado4           Bahia              2.4              NaN  2007
estado5    Minas Gerais              2.7              NaN  2008

In [23]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa Crescimento     object
Ano                   int64
dtype: object

In [24]:
df2.values

array([['Santa Catarina', 1.5, nan, 2004],
       ['Rio de Janeiro', 1.7, nan, 2005],
       ['Tocatins', 1.6, nan, 2006],
       ['Bahia', 2.4, nan, 2007],
       ['Minas Gerais', 2.7, nan, 2008]], dtype=object)

In [27]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa Crescimento     object
Ano                   int64
dtype: object

In [28]:
df2.columns #cabeçalho

Index(['Estado', 'Taxa Desemprego', 'Taxa Crescimento', 'Ano'], dtype='object')

In [31]:
teste1 = np.array([[1,2,3,4,5,6,7,8,9],[10,11,12,13,14,15,16,17,18],[19,20,21,23,24,25,26,27,28]])

dfTeste = DataFrame(teste1)

In [45]:
dfTeste.head()

    0   1   2   3   4   5   6   7   8
0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18
2  19  20  21  23  24  25  26  27  28

In [35]:
# Fatiar o DataFrame

df2['Estado']

estado1    Santa Catarina
estado2    Rio de Janeiro
estado3          Tocatins
estado4             Bahia
estado5      Minas Gerais
Name: Estado, dtype: object

In [37]:
df2[['Estado', 'Ano']]

                 Estado   Ano
estado1  Santa Catarina  2004
estado2  Rio de Janeiro  2005
estado3        Tocatins  2006
estado4           Bahia  2007
estado5    Minas Gerais  2008

In [38]:
df2.index

Index(['estado1', 'estado2', 'estado3', 'estado4', 'estado5'], dtype='object')

In [43]:
#Filtrando pelo índice
df2.filter(items = ['estado2'], axis = 0)

                 Estado  Taxa Desemprego Taxa Crescimento   Ano
estado2  Rio de Janeiro              1.7              NaN  2005

# PANDA e NUMPY para manioulação de dados

In [44]:
df2.head()

                 Estado  Taxa Desemprego Taxa Crescimento   Ano
estado1  Santa Catarina              1.5              NaN  2004
estado2  Rio de Janeiro              1.7              NaN  2005
estado3        Tocatins              1.6              NaN  2006
estado4           Bahia              2.4              NaN  2007
estado5    Minas Gerais              2.7              NaN  2008

In [48]:
# RESUMO ESTATÍSTICO DO DATAFRAME

df2.describe() #resumo somente de valor numerico

       Taxa Desemprego          Ano
count         5.000000     5.000000
mean          1.980000  2006.000000
std           0.535724     1.581139
min           1.500000  2004.000000
25%           1.600000  2005.000000
50%           1.700000  2006.000000
75%           2.400000  2007.000000
max           2.700000  2008.000000

In [50]:
df2.isna() #valor NaN

         Estado  Taxa Desemprego  Taxa Crescimento    Ano
estado1   False            False              True  False
estado2   False            False              True  False
estado3   False            False              True  False
estado4   False            False              True  False
estado5   False            False              True  False

In [51]:
df2['Taxa Crescimento'].isna()

estado1    True
estado2    True
estado3    True
estado4    True
estado5    True
Name: Taxa Crescimento, dtype: bool

In [52]:
# Usando NumPy apra preencher os valores
df2['Taxa Crescimento'] = np.arange(5)

In [53]:
df2['Taxa Crescimento']

estado1    0
estado2    1
estado3    2
estado4    3
estado5    4
Name: Taxa Crescimento, dtype: int32

In [54]:
df2.describe()

       Taxa Desemprego  Taxa Crescimento          Ano
count         5.000000          5.000000     5.000000
mean          1.980000          2.000000  2006.000000
std           0.535724          1.581139     1.581139
min           1.500000          0.000000  2004.000000
25%           1.600000          1.000000  2005.000000
50%           1.700000          2.000000  2006.000000
75%           2.400000          3.000000  2007.000000
max           2.700000          4.000000  2008.000000

In [55]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa Crescimento      int32
Ano                   int64
dtype: object

## Fatiamento de DataFrame

In [56]:
# Todas as linhas do estado2 ao estado4

df2['estado2' : 'estado4']

                 Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado2  Rio de Janeiro              1.7                 1  2005
estado3        Tocatins              1.6                 2  2006
estado4           Bahia              2.4                 3  2007

In [57]:
df2[df2['Taxa Desemprego'] < 2]

                 Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado1  Santa Catarina              1.5                 0  2004
estado2  Rio de Janeiro              1.7                 1  2005
estado3        Tocatins              1.6                 2  2006

In [59]:
df2[['Estado' , 'Taxa Crescimento']]

                 Estado  Taxa Crescimento
estado1  Santa Catarina                 0
estado2  Rio de Janeiro                 1
estado3        Tocatins                 2
estado4           Bahia                 3
estado5    Minas Gerais                 4